Ran Plan for dir: `bridg2/cdp-data-lake-s3` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.cdp-data-lake.aws_s3_bucket.bucket will be created
+ resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "saddam-modulet-test-s3-bucket2"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "env-test"
          + "ManagedBy"   = "corrected-s3-state"
          + "Name"        = "test"
        }
      + tags_all                    = {
          + "Environment" = "env-test"
          + "ManagedBy"   = "corrected-s3-state"
          + "Name"        = "test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.cdp-data-lake.aws_s3_bucket_acl.bucket will be created
+ resource "aws_s3_bucket_acl" "bucket" {
      + acl    = "private"
      + bucket = "saddam-modulet-test-s3-bucket2"
      + id     = (known after apply)
    }

  # module.cdp-data-lake.aws_s3_bucket_lifecycle_configuration.lifecycle_rule[0] will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "lifecycle_rule" {
      + bucket = "saddam-modulet-test-s3-bucket2"
      + id     = (known after apply)

      + rule {
          + id     = "delete-incomplete-multipart-uploads-7days"
          + status = "Disabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + expiration {
              + days                         = 0
              + expired_object_delete_marker = false
            }
        }
    }

  # module.cdp-data-lake.aws_s3_bucket_ownership_controls.bucket will be created
+ resource "aws_s3_bucket_ownership_controls" "bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.cdp-data-lake.aws_s3_bucket_public_access_block.bucket will be created
+ resource "aws_s3_bucket_public_access_block" "bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "saddam-modulet-test-s3-bucket2"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.cdp-data-lake.aws_s3_bucket_server_side_encryption_configuration.bucket will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "bucket" {
      + bucket = "saddam-modulet-test-s3-bucket2"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "aws:kms"
            }
        }
    }

  # module.cdp-data-lake.aws_s3_bucket_versioning.bucket will be created
+ resource "aws_s3_bucket_versioning" "bucket" {
      + bucket = "saddam-modulet-test-s3-bucket2"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Disabled"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on ../modules/s3/output.tf line 3, in output "aws_s3_bucket_website_configuration":
│    3:   value       = aws_s3_bucket.bucket.website_endpoint
│ 
│ The attribute "website_endpoint" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and one more similar warning elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d bridg2/cdp-data-lake-s3`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=saddamkafil%252Fterraform-s3-modules-approach%252Fbridg2%252Fcdp-data-lake-s3%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d bridg2/cdp-data-lake-s3`
</details>
Plan: 7 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`